tap "leoafarias/fvm"
brew "aarch64-elf-binutils"
brew "aarch64-elf-gcc"
brew "aws-sso-util"
brew "awscli"
brew "awsume"
brew "azure-cli"
brew "batt", restart_service: :changed
brew "binutils"
brew "biome"
brew "boost"
brew "buf"
brew "catch2"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "cpp-httplib"
brew "docker"
brew "doxygen"
brew "dropbear"
brew "ffmpeg"
brew "findutils"
brew "gawk"
brew "gcc"
brew "ghidra"
brew "git-gui"
brew "git"
brew "go-task"
brew "graphviz"
brew "grep"
brew "grpc"
brew "grpcurl"
brew "icu4c@76"
brew "javacc"
brew "jq"
brew "keepassc"
brew "kind"
brew "kubernetes-cli"
brew "leoafarias/fvm/fvm"
brew "libmagic"
brew "libvirt-glib"
brew "maven"
brew "mecab-ipadic"
brew "mecab"
brew "minikube"
brew "mise"
brew "mono"
brew "moreutils"
brew "ninja"
brew "nkf"
brew "nlohmann-json"
brew "node"
brew "opencv"
brew "openjdk"
brew "parquet-cli"
brew "pkgconf"
brew "podman"
brew "poetry"
brew "poppler"
brew "portaudio"
brew "postgresql@17"
brew "protobuf"
brew "proxychains-ng"
brew "pv"
brew "qemu"
brew "qrencode"
brew "socat"
brew "sqlite-utils"
brew "sqlitecpp"
brew "sshpass"
brew "tmux"
brew "unar"
brew "virt-manager"
brew "watch"
brew "wget"
brew "xz"
brew "yt-dlp"
cask "audacity"
cask "blender"
cask "claude"
cask "discord"
cask "dotnet-sdk"
cask "epic-games"
cask "firefox"
cask "gcc-aarch64-embedded"
cask "gcc-arm-embedded"
cask "gimp"
cask "google-chrome"
cask "gstreamer-development"
cask "gstreamer-runtime"
cask "inkscape"
cask "kindle"
cask "notion"
cask "obs"
cask "podman-desktop"
cask "rectangle"
cask "slack"
cask "steam"
cask "temurin"
cask "visual-studio-code"
cask "visualvm"
cask "vlc"
cask "warp"
cask "wine-stable"
cask "zoom"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "github.copilot-chat"
vscode "github.copilot"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ionide.ionide-fsharp"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "prisma.prisma"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "timonwong.shellcheck"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "wix.vscode-import-cost"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
go "cmd/go"
go "cmd/gofmt"
