brew "xz"
brew "aws-sso-util"
brew "awscli"
brew "awsume"
brew "batt", restart_service: :changed
brew "biome"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "docker"
brew "findutils"
brew "gawk"
brew "ghidra"
brew "git-gui"
brew "graphviz"
brew "grep"
brew "libmagic"
brew "libvirt-glib"
brew "mecab"
brew "mecab-ipadic"
brew "mise"
brew "moreutils"
brew "opencv"
brew "parquet-cli"
brew "podman"
brew "poppler"
brew "portaudio"
brew "postgresql@17"
brew "proxychains-ng"
brew "pv"
brew "socat"
brew "sshpass"
brew "tmux"
brew "unar"
brew "virt-manager"
brew "yt-dlp"
cask "claude"
cask "firefox"
cask "gcc-aarch64-embedded"
cask "gcc-arm-embedded"
cask "ghidra"
cask "gimp"
cask "google-chrome"
cask "inkscape"
cask "notion"
cask "podman-desktop"
cask "rectangle"
cask "temurin"
cask "visual-studio-code"
cask "visualvm"
cask "vlc"
cask "warp"
cask "zoom"
vscode "anthropic.claude-code"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "prisma.prisma"
vscode "timonwong.shellcheck"
vscode "vscodevim.vim"
vscode "wix.vscode-import-cost"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
go "cmd/go"
go "cmd/gofmt"
